import React from 'react'

import { useEffect, useState, useRef } from "react";
import { useJsApiLoader } from '@react-google-maps/api';

function GoogleMap() {
  const ref = useRef(null);
  const [googleMap, setGoogleMap] = useState(null);
  const libraries = ['marker'];

  
  const { isLoaded } = useJsApiLoader({
    googleMapsApiKey: 'AIzaSyDnc8Ff7lGdmiLBiIRKDhVRdKu8s9dzVpw',  // 여기에 API 키를 입력하세요
    libraries: libraries,  // 'marker' 라이브러리를 로드
  });
  const stringCoordinates =  [('127.057436046716', '37.6180767967353'), ('127.059504676027', '37.6213607728479'), ('127.060820134493', '37.6231891063632'), ('127.058203293092', '37.6200694057919'), ('127.05902549288251', '37.62131326117863'), ('127.05881060974359', '37.62030155947812'), ('127.05962812068', '37.6227500329914'), ('127.057609148638', '37.6192876400272'), ('127.06067039501', '37.6229242932203'), ('127.05878772699671', '37.62001145287181'), ('127.05998599082864', '37.62265074300844'), ('127.057314743468', '37.6194139216729'), ('127.059456992958', '37.6212247477794'), ('127.058425504853', '37.6203251764627'), ('127.053513878053', '37.6200887443682'), ('127.057597646485', '37.6190605967224'), ('127.05874302041659', '37.62077641358956'), ('127.057293709771', '37.6185733102653'), ('127.058821341782', '37.6224215775715'), ('127.062640699223', '37.6167010429673'), ('127.06135910814515', '37.62016511369336'), ('127.05721248823', '37.6190067248214'), ('127.05831215165', '37.6202207179696'), ('127.058203273425', '37.6200441781477'), ('127.060253970181', '37.6234560890118'), ('127.05868291742625', '37.62068904770362'), ('127.061145707899', '37.6223816535661'), ('127.056608883773', '37.617674454811'), ('127.062596786796', '37.6170128081547'), ('127.057014407999', '37.6206754498678'), ('127.060058546328', '37.6227245870602'), ('127.057219278881', '37.6189995136264'), ('127.057691705551', '37.619119114981'), ('127.059818526685', '37.6172241794109'), ('127.061243082418', '37.6209499341225'), ('127.058275139664', '37.6192404616491'), ('127.059990524729', '37.6226543446578'), ('127.05721815792296', '37.619014830962605'), ('127.061160407774', '37.6223501113935'), ('127.058837160649', '37.620934039508'), ('127.061180529287', '37.6206409278542'), ('127.058321210548', '37.6202171095369')]

  const numericCoordinates = stringCoordinates.map(coord => {
    const [lng, lat] = coord; // 튜플에서 경도(lng)와 위도(lat) 분리
    return { lng: parseFloat(lng), lat: parseFloat(lat) };  // 문자열을 숫자형으로 변환
  });

  useEffect(() => {
    if (isLoaded && ref.current && !googleMap) {
      const initialMap = new window.google.maps.Map(ref.current, {
        center: {
          lat: 37.6194277,
          lng: 127.05982,
        },
        zoom: 16,
        mapId: 'c9791892f7e8b0c0',
      });

      setGoogleMap(initialMap);  // 구글 맵 인스턴스를 상태에 저장
    }
  }, [isLoaded, googleMap]);

  useEffect(() => {
    if (googleMap) {
      numericCoordinates.forEach(({ lng, lat }) => {
        const marker = new window.google.maps.Marker({
          position: { lat, lng },
          map: googleMap,
        });

        // 마커를 클릭했을 때 동작을 추가하고 싶다면 이곳에서 이벤트 리스너 추가
        marker.addListener('click', () => {
          window.alert(`Marker at: ${lat}, ${lng}`);
        });
      });
    }
  }, [googleMap, numericCoordinates]);
 
      
  return <div ref={ref} id="map" style={{ minHeight: '100vh' }} />;
}
  

export default GoogleMap;

